def area(a, b):
'''
	Возвращает произведение двух десятичных чисел (площадь).
		
		Параметры:
			a (int): первое десятичное число, первая сторона прямоугольника
			b (int): второе десятичное число, вторая сторона прямоугольника
		Пример: area(2, 4)
		Output: 8.0


''' 
return a * b 

def perimeter(a, b): 
	'''
	Возвращает сумму удвоенного десятичного числа a и удвоенного десятичного числа b (периметр)

		Параметры:
		a (int): первое десятичное число, первая сторона прямоугольника
		b (int): второе десятичное число, вторая сторона прямоугольника
		Пример: perimeter(2, 4)
		Output: 12.0
	'''
return (2 * a) + (2 * b) 