def area(a, b):
'''
	Возвращает произведение двух десятичных чисел (площадь).
		
		Параметры:
			a (int): первое десятичное число, первая сторона прямоугольника
			b (int): второе десятичное число, вторая сторона прямоугольника
		Пример:


''' 
return a * b 

def perimeter(a, b): 
	'''
	Возвращает сумму удвоенного десятичного числа a и удвоенного десятичного числа b (периметр)

		Параметры:
		a (int): первое десятичное число, первая сторона прямоугольника
		b (int): второе десятичное число, вторая сторона прямоугольника
	'''
return (2 * a) + (2 * b) 