def area(a, h):
	''' Возвращает произведение двух десятичных чисел, деленное на 2
		
		Параметры:
			a (int): первое десятичное число, сторона треугольника
			b (int): второе десятичное число, высота треугольника

	'''
	return a * h / 2

def perimeter(a, b, c):
	'''Возвращает сумму трех десятичных чисел
		
		Параметры:
			a (int): первое десятичное число, сторона треугольника 
			b (int): второе десятичное число, сторона треугольника 
			c (int): третье десятичное число, сторона треугольника 

	'''
	return a + b + c