def area(a, h):
	''' Возвращает произведение двух десятичных чисел, деленное на 2
		
		Параметры:
			a (int): первое десятичное число, сторона треугольника
			b (int): второе десятичное число, высота треугольника
		Пример: area(4, 3)
		Output: 6.0

	'''
	return a * h / 2

def perimeter(a, b, c):
	'''Возвращает сумму трех десятичных чисел
		
		Параметры:
			a (int): первое десятичное число, сторона треугольника 
			b (int): второе десятичное число, сторона треугольника 
			c (int): третье десятичное число, сторона треугольника
		Пример: 2, 3, 4
		Output: 9.0

	'''
	return a + b + c